import React, { useState } from "react";
import Mihfadha from "./partials/Mihfadha";

function FourthPage() {
  const mihfadhaConst = [
    {
      id: 0,
      title: "محفظة الدخل",
      content:
        "الخيار الأفضل للأفراد الذين يرغبون في تحقيق دخلاّ ثابتّا و مستمرّا من إستثماراتهم",
      text: "محفظة الدخل هي الخيار الامثل للأفراد الذين يرغبون في تحقيق دخلاً ثابتاً ومستمراً من استثماراتهم، حيث تركز هذه المحفظة على الاستثمار في الأدوات المالية ذات العائدات الثابتة والمستمرة، كما أنها تستغل النسبة الأكبر من سيولتها في العمليات المضاربية، وذلك لتحقيق أهداف الاستثمار القصيرة الأجل، وبالتالي مرونة أكبر في تنويع أصولهم الاستثمارية،  وتعد خياراً رائعا لتحقيق الاستقرار المالي للأفراد، مما يساعدهم على تلبية احتياجاتهم المالية بشكل دوري ومستمر دون المخاطرة بفقدان رأس المال أو تعريضه للمخاطر العالية، وبالتالي المساهمة في تحقيق الأهداف الاستثمارية بشكل متوازن ومستدام.",
      nawaad: "شهرية",
      souhoubet: "شهرية",
      moutawastaaed: 12,
      inhiraf: 40,
      nisbatkhatar: 3,
    },
    {
      id: 1,
      title: "محفظة النمو",
      content:
        "واحدة من أهم الخيارات الإستثمارية و تتميز بالإستقرار و تجنب المخاطر",
      text: "تعتبر محفظة النمو واحدة من أهم الخيارات الاستثمارية، حيث تتيح للطموحين فرصة استثنائية للاستثمار في مجموعة واسعة من الأصول الاستثمارية على المدى البعيد، حيث تستهدف تحقيق العوائد المالية متوسطة الأجل، تتميز بالاستقرار وتجنب المخاطر، وتعتمد على استثمار الأموال لفترات متوسطة وطويلة نسبياً مما يقلل من تأثير التقلبات السريعة للسوق، وتتيح فرصة رائعة للاستفادة من النمو طويل الأجل للاقتصاد والشركات وتقليل تأثير التضخم على قيمة الأموال، مما يحقق أهدافهم المالية بشكل أكثر أماناً وفاعلية، وتعد الخيار الأمثل لمن يفكر في فترة التقاعد أو الزواج أو تمويل التعليم لأطفاله أو تأمين سكن مريح. ",
      nawaad: "ربع سنوية",
      souhoubet: "شهرية",
      moutawastaaed: 6,
      inhiraf: 15,
      nisbatkhatar: 1,
    },
    {
      id: 2,
      title: "المحفظة المرنة",
      content: "مزيد من المرونة و السيطرة على مستوى المخاطر و العوائد المتوقعة",
      text: "تتيح المحفظة الاستثمارية المرنة مزيداً من المرونة والسيطرة على مستوى المخاطر وعوائد الاستثمار، حيث يمكن تعديل تكوين المحفظة بكل سهولة بما يتناسب مع تغيرات السوق وظروف الاقتصاد مما يساهم في تكيفها مع المستجدات بشكل سريع وفعال، وهذا يحمي المستثمر من الخسائر المحتملة ويزيد من فرص الحصول على العوائد الإيجابية خلال وقت أقل، بالإضافة إلى ذلك، تتيح المحفظة الاستثمارية المرنة إمكانية تسييل الأصول بسرعة أكبر، مما يجعلها خياراً مناسباً للمستثمرين الذين يفضلون المرونة في عمليات السحب بين حين وآخر مع الحفاظ على التوازن الآمن بين مستوى المخاطرة والعوائد الجيدة.",
      nawaad: "سنوية",
      souhoubet: "مرنة",
      moutawastaaed: 12,
      inhiraf: 30,
      nisbatkhatar: 2,
    },
    {
      id: 3,
      title: "المحفظة المتحفظة",
      content: "مستوى منخفض من المخاطر",
      text: "تتميز المحفظة الاستثمارية المتحفظة بمستوى منخفض من المخاطر، حيث تستهدف الاستثمار في الأدوات المالية ذات العائدات المستقرة، وذلك لتحقيق أهداف الاستثمار طويلة الأجل بشكل متحفظ وبمستوى عالي من الأمان، مما يتيح للمستثمر تنويع الأصول المكونة لمحفظته الاستثمارية بشكل مدروس بعناية تامة لتحقيق توازن الفعّال بين العوائد والمخاطر، و يجعلها خياراً مناسباً للمستثمرين المتحفظين الذين يأملون تحقيق عوائد مستقرة نسبياً لرؤوس أموالهم الراكدة في حساباتهم البنكية لفترات طويلة  مع مستوى عالي من الأمان، مما يساعده على تحقيق الأهداف الاستثمارية بطريقة متحفظة ومستقرة.",
      nawaad: "شهرية",
      souhoubet: "ربع شهرية",
      moutawastaaed: 41,
      inhiraf: 15,
      nisbatkhatar: 4,
    },
  ];

  const [selectedMihfadha, setSelectedMihfadha] = useState(mihfadhaConst[0]);

  const handleButtonClick = (index) => {
    setSelectedMihfadha(mihfadhaConst[index]);
  };

  return (
    <div className="flex flex-col items-center justify-center w-full gap-2 pb-32">
      <div className="flex flex-col items-center justify-center w-full lg:w-[66%] gap-6 pt-32 ">
        <div className="flex flex-col items-center gap-6">
          <p className="text-3xl font-bold lg:text-5xl ">
            {" "}
            المحافظ الاستثمارية
          </p>
          <p className="text-[#737987]  font-light text-base leading-9">
            متنوعة تلبي احتياجاتك
          </p>
        </div>

        <div
          className=" rounded-md  w-full px-3 font-light text-base text-[#737987]"
          role="group"
        >
          {mihfadhaConst.map((item, index) => (
            <div key={index} className="p-[2px] ">
              <button
                type="button"
                className={`px-4 py-2 text-sm font-medium   bg-[#F3F4F6] rounded-lg w-full  ${
                  item.id === selectedMihfadha.id
                    ? "bg-[#0174B7] text-white"
                    : ""
                } ${index === 0 && "rounded-s-lg"} ${
                  index === mihfadhaConst.length - 1 && "rounded-e-lg"
                }`}
                onClick={() => handleButtonClick(index)}
              >
                {item.title}
              </button>
            </div>
          ))}
        </div>
      </div>
      <div className="w-full px-3 lg:flex lg:justify-center">
        {selectedMihfadha && <Mihfadha data={selectedMihfadha} />}
      </div>
    </div>
  );
}

export default FourthPage;
